// Ви повинні реалізувати функцію, яка повертає різницю між найбільшим та найменшим значенням у списку , отриманому як аргумент функції. Масив, який отримує функція як аргумент, може містити позитивні та негативні числа. Якщо масив порожній або має 1 значення, поверніть нуль. Спочатку масив буде поданий у невідсортованому вигляді.
// arr([1, 2, 3, -4]); // вернет 7, потому что: 3 - (-4) == 7
// arr([16]) => 0

console.log('TASK 1'.padStart(20, '_').padEnd(40, '_'))

const task1 = (arr) => {
    if (arr.length <= 1) return 0

    let max = 0
    for (let i = 0; i < arr.length; i++) {
        if (max < arr[i + 1]) max = arr[i + 1]
    }

    let min = max
    for (let i = 0; i < arr.length; i++) {
        if (min > arr[i]) min = arr[i]
    }

    return max - min
}
console.log(task1([1, 2, 3, -4]))
console.log(task1([16]))